## Production: eks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 17 to add, 1 to change, 3 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                               NAME                                               |
|----------|--------------------------------------------------------------------------------------------------|
| recreate | `aws_secretsmanager_secret_version.eks_karpenter_ami_id`                                         |
| add      | `aws_secretsmanager_secret.gha_vpn_cert`                                                         |
|          | `aws_secretsmanager_secret.gha_vpn_key`                                                          |
|          | `aws_secretsmanager_secret_version.gha_vpn_cert`                                                 |
|          | `aws_secretsmanager_secret_version.gha_vpn_key`                                                  |
|          | `module.gha_vpn.aws_acm_certificate.client_vpn[0]`                                               |
|          | `module.gha_vpn.aws_cloudwatch_log_group.this`                                                   |
|          | `module.gha_vpn.aws_ec2_client_vpn_authorization_rule.this_internal_dns`                         |
|          | `module.gha_vpn.aws_ec2_client_vpn_authorization_rule.this_subnets_certificate[&quot;10.0.0.0/24&quot;]`   |
|          | `module.gha_vpn.aws_ec2_client_vpn_authorization_rule.this_subnets_certificate[&quot;10.0.1.0/24&quot;]`   |
|          | `module.gha_vpn.aws_ec2_client_vpn_authorization_rule.this_subnets_certificate[&quot;10.0.2.0/24&quot;]`   |
|          | `module.gha_vpn.aws_ec2_client_vpn_endpoint.this`                                                |
|          | `module.gha_vpn.aws_ec2_client_vpn_network_association.this_subnets[&quot;subnet-0c68946095ba18faf&quot;]` |
|          | `module.gha_vpn.aws_security_group.this`                                                         |
|          | `module.gha_vpn.aws_security_group_rule.egress_all`                                              |
|          | `module.gha_vpn.tls_private_key.client_vpn[0]`                                                   |
|          | `module.gha_vpn.tls_self_signed_cert.client_vpn[0]`                                              |
| delete   | `module.vpn.aws_ec2_client_vpn_network_association.this_subnets[&quot;subnet-003252752c8a83c9f&quot;]`     |
|          | `module.vpn.aws_ec2_client_vpn_network_association.this_subnets[&quot;subnet-0372dd9f5c68cdf14&quot;]`     |
| update   | `aws_eks_node_group.notification-canada-ca-eks-node-group-k8s`                                   |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_eks_node_group.notification-canada-ca-eks-node-group-k8s will be updated in-place
  ~ resource "aws_eks_node_group" "notification-canada-ca-eks-node-group-k8s" {
        id                   = "notification-canada-ca-production-eks-cluster:notification-canada-ca-production-eks-primary-node-group-k8s"
      ~ release_version      = "1.30.0-20240522" -> "1.30.0-20240605"
        tags                 = {
            "CostCenter"             = "notification-canada-ca-production"
            "Name"                   = "notification-canada-ca"
            "karpenter.sh/discovery" = "notification-canada-ca-production-eks-cluster"
        }
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_secretsmanager_secret.gha_vpn_cert will be created
  + resource "aws_secretsmanager_secret" "gha_vpn_cert" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "GHA_VPN_CERT"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags_all                       = (known after apply)
    }

  # aws_secretsmanager_secret.gha_vpn_key will be created
  + resource "aws_secretsmanager_secret" "gha_vpn_key" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "GHA_VPN_KEY"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags_all                       = (known after apply)
    }

  # aws_secretsmanager_secret_version.eks_karpenter_ami_id must be replaced
-/+ resource "aws_secretsmanager_secret_version" "eks_karpenter_ami_id" {
      ~ arn            = "arn:aws:secretsmanager:ca-central-1:296255494825:secret:EKS_KARPENTER_AMI_ID-ApW79n" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:ca-central-1:296255494825:secret:EKS_KARPENTER_AMI_ID-ApW79n|terraform-20240610153651233500000001" -> (known after apply)
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "terraform-20240610153651233500000001" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_secretsmanager_secret_version.gha_vpn_cert will be created
  + resource "aws_secretsmanager_secret_version" "gha_vpn_cert" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_secretsmanager_secret_version.gha_vpn_key will be created
  + resource "aws_secretsmanager_secret_version" "gha_vpn_key" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # module.gha_vpn.aws_acm_certificate.client_vpn[0] will be created
  + resource "aws_acm_certificate" "client_vpn" {
      + arn                       = (known after apply)
      + certificate_body          = (known after apply)
      + domain_name               = (known after apply)
      + domain_validation_options = (known after apply)
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + private_key               = (sensitive value)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = (known after apply)
      + tags_all                  = (known after apply)
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = (known after apply)
    }

  # module.gha_vpn.aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/client-vpn-endpoint/gha-vpn"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags              = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Source"     = "cds-snc/terraform-modules/client_vpn"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Source"     = "cds-snc/terraform-modules/client_vpn"
          + "Terraform"  = "true"
        }
    }

  # module.gha_vpn.aws_ec2_client_vpn_authorization_rule.this_internal_dns will be created
  + resource "aws_ec2_client_vpn_authorization_rule" "this_internal_dns" {
      + authorize_all_groups   = true
      + client_vpn_endpoint_id = (known after apply)
      + description            = "Authorization for gha-vpn to DNS"
      + id                     = (known after apply)
      + target_network_cidr    = "10.0.0.2/32"
    }

  # module.gha_vpn.aws_ec2_client_vpn_authorization_rule.this_subnets_certificate["10.0.0.0/24"] will be created
  + resource "aws_ec2_client_vpn_authorization_rule" "this_subnets_certificate" {
      + authorize_all_groups   = true
      + client_vpn_endpoint_id = (known after apply)
      + description            = "Rule name: 10.0.0.0/24"
      + id                     = (known after apply)
      + target_network_cidr    = "10.0.0.0/24"
    }

  # module.gha_vpn.aws_ec2_client_vpn_authorization_rule.this_subnets_certificate["10.0.1.0/24"] will be created
  + resource "aws_ec2_client_vpn_authorization_rule" "this_subnets_certificate" {
      + authorize_all_groups   = true
      + client_vpn_endpoint_id = (known after apply)
      + description            = "Rule name: 10.0.1.0/24"
      + id                     = (known after apply)
      + target_network_cidr    = "10.0.1.0/24"
    }

  # module.gha_vpn.aws_ec2_client_vpn_authorization_rule.this_subnets_certificate["10.0.2.0/24"] will be created
  + resource "aws_ec2_client_vpn_authorization_rule" "this_subnets_certificate" {
      + authorize_all_groups   = true
      + client_vpn_endpoint_id = (known after apply)
      + description            = "Rule name: 10.0.2.0/24"
      + id                     = (known after apply)
      + target_network_cidr    = "10.0.2.0/24"
    }

  # module.gha_vpn.aws_ec2_client_vpn_endpoint.this will be created
  + resource "aws_ec2_client_vpn_endpoint" "this" {
      + arn                     = (known after apply)
      + client_cidr_block       = "172.16.0.0/22"
      + description             = "gha-vpn"
      + dns_name                = (known after apply)
      + dns_servers             = [
          + "10.0.0.2",
          + "8.8.8.8",
        ]
      + id                      = (known after apply)
      + security_group_ids      = (known after apply)
      + self_service_portal     = "enabled"
      + self_service_portal_url = (known after apply)
      + server_certificate_arn  = "arn:aws:acm:ca-central-1:296255494825:certificate/f34d679e-9167-41ff-b525-2a816f6883cd"
      + session_timeout_hours   = 8
      + split_tunnel            = true
      + tags                    = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Source"     = "cds-snc/terraform-modules/client_vpn"
          + "Terraform"  = "true"
        }
      + tags_all                = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Source"     = "cds-snc/terraform-modules/client_vpn"
          + "Terraform"  = "true"
        }
      + transport_protocol      = "udp"
      + vpc_id                  = "vpc-0e02e0295db594518"
      + vpn_port                = 443

      + authentication_options {
          + root_certificate_chain_arn = (known after apply)
          + type                       = "certificate-authentication"
        }

      + client_login_banner_options {
          + banner_text = "Welcome to the Notify PRODUCTION Environment. This is a private network.  Only authorized users may connect and should take care not to cause service disruptions."
          + enabled     = true
        }

      + connection_log_options {
          + cloudwatch_log_group  = "/aws/client-vpn-endpoint/gha-vpn"
          + cloudwatch_log_stream = (known after apply)
          + enabled               = true
        }
    }

  # module.gha_vpn.aws_ec2_client_vpn_network_association.this_subnets["subnet-0c68946095ba18faf"] will be created
  + resource "aws_ec2_client_vpn_network_association" "this_subnets" {
      + association_id         = (known after apply)
      + client_vpn_endpoint_id = (known after apply)
      + id                     = (known after apply)
      + subnet_id              = "subnet-0c68946095ba18faf"
      + vpc_id                 = (known after apply)
    }

  # module.gha_vpn.aws_security_group.this will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Egress All. Used to allow access to other security groups."
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "client-vpn-endpoint-gha-vpn"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Source"     = "cds-snc/terraform-modules/client_vpn"
          + "Terraform"  = "true"
        }
      + tags_all               = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Source"     = "cds-snc/terraform-modules/client_vpn"
          + "Terraform"  = "true"
        }
      + vpc_id                 = "vpc-0e02e0295db594518"
    }

  # module.gha_vpn.aws_security_group_rule.egress_all will be created
  + resource "aws_security_group_rule" "egress_all" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.gha_vpn.tls_private_key.client_vpn[0] will be created
  + resource "tls_private_key" "client_vpn" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 2048
    }

  # module.gha_vpn.tls_self_signed_cert.client_vpn[0] will be created
  + resource "tls_self_signed_cert" "client_vpn" {
      + allowed_uses          = [
          + "key_encipherment",
          + "digital_signature",
          + "server_auth",
          + "ipsec_end_system",
          + "ipsec_tunnel",
          + "any_extended",
          + "cert_signing",
        ]
      + cert_pem              = (known after apply)
      + early_renewal_hours   = 0
      + id                    = (known after apply)
      + is_ca_certificate     = false
      + key_algorithm         = (known after apply)
      + private_key_pem       = (sensitive value)
      + ready_for_renewal     = false
      + set_authority_key_id  = false
      + set_subject_key_id    = false
      + validity_end_time     = (known after apply)
      + validity_period_hours = 8760
      + validity_start_time   = (known after apply)

      + subject {
          + common_name  = "cds-snc.ca"
          + organization = "Canadian Digital Service"
        }
    }

  # module.vpn.aws_ec2_client_vpn_network_association.this_subnets["subnet-003252752c8a83c9f"] will be destroyed
  # (because key ["subnet-003252752c8a83c9f"] is not in for_each map)
  - resource "aws_ec2_client_vpn_network_association" "this_subnets" {
      - association_id         = "cvpn-assoc-08b98450aadcf0e33" -> null
      - client_vpn_endpoint_id = "cvpn-endpoint-06ea6bb8a835c6e2a" -> null
      - id                     = "cvpn-assoc-08b98450aadcf0e33" -> null
      - subnet_id              = "subnet-003252752c8a83c9f" -> null
      - vpc_id                 = "vpc-0e02e0295db594518" -> null
    }

  # module.vpn.aws_ec2_client_vpn_network_association.this_subnets["subnet-0372dd9f5c68cdf14"] will be destroyed
  # (because key ["subnet-0372dd9f5c68cdf14"] is not in for_each map)
  - resource "aws_ec2_client_vpn_network_association" "this_subnets" {
      - association_id         = "cvpn-assoc-000e9ced6c35f0dda" -> null
      - client_vpn_endpoint_id = "cvpn-endpoint-06ea6bb8a835c6e2a" -> null
      - id                     = "cvpn-assoc-000e9ced6c35f0dda" -> null
      - subnet_id              = "subnet-0372dd9f5c68cdf14" -> null
      - vpc_id                 = "vpc-0e02e0295db594518" -> null
    }

  # module.vpn.aws_iam_saml_provider.client_vpn has moved to module.vpn.aws_iam_saml_provider.client_vpn[0]
    resource "aws_iam_saml_provider" "client_vpn" {
        id                     = "arn:aws:iam::296255494825:saml-provider/client-vpn"
        name                   = "client-vpn"
        tags                   = {
            "CostCentre" = "notification-canada-ca-production"
            "Source"     = "cds-snc/terraform-modules/client_vpn"
            "Terraform"  = "true"
        }
        # (4 unchanged attributes hidden)
    }

Plan: 17 to add, 1 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.celery-error[0]"]
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.scanfiles-timeout[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.client_vpn"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca-alt[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.internal_alb_tls"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.internal_nginx_http"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-documentation"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-application-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-cluster-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-prometheus-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-evicted-pods[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-cpu-warning[0]"]
WARN - plan.json - main -...
```

</details>
